# Pandas

Pandas is an open-source data analysis and manipulation library for Python. It provides easy-to-use data structures and data analysis tools to work with structured data seamlessly. The two primary data structures provided by Pandas are:

- `Series`: A one-dimensional array-like object that can hold any data type such as integers, strings, floating-point numbers, and Python objects.

- `DataFrame`: A two-dimensional table-like data structure that consists of rows and columns. It can be thought of as a spreadsheet or SQL table.

In addition to these data structures, Pandas also provides various tools for data manipulation, such as merging, grouping, and reshaping data.

## Installing Pandas

Before we get started, let's first make sure that Pandas is installed. You can install Pandas using `pip` by running the command `pip3 install pandas` in your terminal. You can also install it directly here using:

```bash
pip3 install pandas

```

## Creating DataFrame

To create a DataFrame, you can use the `pd.DataFrame()` function and pass in your data as a Python dictionary or a list of lists.

In [1]:
# Import pandas library
import pandas as pd

# Create a DataFrame from a dictionary
data = {'name': ['John','Harry','Alice'], 'age': [20, 30 ,40]} 
df = pd.DataFrame(data)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

    name  age
0   John   20
1  Harry   30
2  Alice   40

In [2]:
# Create a DataFrame from a list of lists 
data = [['John', 20], ['Harry', 30], ['Alice', 40]]
df_list = pd.DataFrame(data, columns=['name', 'age'])
print(type(df_list))
df_list

<class 'pandas.core.frame.DataFrame'>

    name  age
0   John   20
1  Harry   30
2  Alice   40

## Accessing Data

You can access data in a DataFrame using various methods. Here are some common ones:

### Indexing

- `df[col_name]`: Access a single column by column name. Return-Type: Series.
- `df[[col1, col2, ...]]`: Access multiple columns by column name. Return-Type: DataFrame.

In [3]:
df['name']      # Access a single column

0     John
1    Harry
2    Alice
Name: name, dtype: object

In [4]:
df[['name', 'age']]     # Access multiple columns

    name  age
0   John   20
1  Harry   30
2  Alice   40

### Condition based Filtering

- `df[condition]`: Filter data based on the given condition

In [5]:
# Select row in which age is greater than 25
df[df['age']>25]

    name  age
1  Harry   30
2  Alice   40

In [6]:
# Select row in which given name is included in name column
df[df['name'].isin(['Alice', 'Happy'])]

    name  age
2  Alice   40

In [7]:
# Select row having name that begins with 'A' and age above 23
df[df['name'].str.startswith('A') & (df['age']>23)]

    name  age
2  Alice   40

### Methods
 In Pandas, there are three main indexing methods to access data in a DataFrame: `loc`, `iloc`, and `at`.
 
- `df.loc[]`: Access data in a DataFrame using labels. It takes two parameters, the row label(s) and column label(s), and returns a subset of the original DataFrame. 

- `df.iloc[]`: Access data in a DataFrame using integer-based indexing. It takes two parameters, the row index(es) and column index(es), and returns a subset of the original DataFrame.

- `df.at[]`: Access a single cell in a DataFrame using labels. It is similar to `df.loc`, but is optimized for accessing a single cell.

In [8]:
print(df.loc[0],                    # Access a row data in a Dataframe
      df.loc[0, 'name'],            # Access single cell by label  
      df.loc[0:1],                  # Access multiple rows and columns
      df.loc[1:2, ['name', 'age']], # Access multiple rows and columns
      sep='\n\n')

name    John
age       20
Name: 0, dtype: object

John

    name  age
0   John   20
1  Harry   30

    name  age
1  Harry   30
2  Alice   40

In [9]:
print(df.iloc[0],                 # Access a row data in a DataFrame
      df.iloc[0, 0],              # Access single cell by index
      df.iloc[0:3],               # Access multiple rows
      df.iloc[1:3, [0, 1]],       # Access multiple rows and columns (assuming indices for 'name', 'age')
      sep='\n\n')

name    John
age       20
Name: 0, dtype: object

John

    name  age
0   John   20
1  Harry   30
2  Alice   40

    name  age
1  Harry   30
2  Alice   40

In [10]:
df.at[0, 'name']  # Access the 'name' cell in the first row

'John'

> Note: </br>
    - `.iloc` is exclusive of the end index, unlike `.loc`</br>
    - `.at` is the fastest accessor for accessing a single value</br>
    - If you try to use slicing or multiple access patterns with `.at`, you'll receive an error

## Reading Data

Pandas can read data from a variety of sources, including CSV files, Excel spreadsheets, SQL databases, and more. Here are some common ways to read data using Pandas:

- `pd.read_csv(file_path, delimiter=',')`: Reads CSV (Comma Separated Value) file and returns a Pandas DataFrame
    - *file_path*: Path to csv file
    - *delimiter*: Symbol separating different columns (default=',')
    
- `pd.read_excel(file_path, sheet_name=0)`: Reads excel file and returns a Pandas DataFrame
    - *file_path*: Path to excel file
    - *sheet_name*: Name or Index of List of excel sheet(s) to use (default=0)
    
- `pd.read_sql(query, conn)`: Read data from SQL databases. To do this, you first need to establish a connection to the database using a database driver such as `sqlite3` or `pymysql`.
    - *query*: SQL query
    - *conn*: Connection to SQL database

In [11]:
import pandas as pd

path = "../assets/Datasets/House-Price.csv"
data = pd.read_csv(path)

## Writing Data

Similar to reading data from files, pandas provides several methods to write data to various file formats such as CSV, Excel, JSON, SQL, and more.

- `pd.to_csv(file_path, index)`: Writes Pandas DataFrame to csv file
    - *file_path*: Expected path to write csv file
    - *index*: If you want to add an extra column with row-wise indexing? (default=True)
    
- `pd.to_excel(file_path, index)`: Writes Pandas DataFrame to excel file

- `df.to_sql(table_name, conn, if_exists, index)`:
    - *table_name*: Database table name to write data into
    - *conn*: Connection to SQL database
    - *if_exists*: What if the table already exists? Options: {'fail', 'replace', 'append'} (default='fail')

In [13]:
import pandas as pd

data = pd.DataFrame({'name': ['Harry', 'Alice', 'Bob'], 'age': [25, 30, 40]})
data.to_csv('../assets/Datasets/data.csv', index=False) # index=False --> Don't write index

## Exploring Data

- `df.head()`: Returns the first few rows (default=5) of the DataFrame
- `df.tail()`: Returns the last few rows (default=5) of the DataFrame
- `df.info()`: Returns information about the DataFrame
- `df.describe()`: Returns descriptive statistics for the numerical columns in the DataFrame
- `df.shape`: Returns shape of the DataFrame
- `df.isnull()`: Check for missing values

In [14]:
df.head(2)      # Returns first 2 rows (default=5)

    name  age
0   John   20
1  Harry   30

In [15]:
df.tail(4)     # Returns first 4 rows (default=5)

    name  age
0   John   20
1  Harry   30
2  Alice   40

In [16]:
df.info()      # Returns information of loaded Dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [17]:
df.describe()      # Returns descriptive statistics of every numerical columns

        age
count   3.0
mean   30.0
std    10.0
min    20.0
25%    25.0
50%    30.0
75%    35.0
max    40.0

In [18]:
df.isnull()     # Checks for missing values

    name    age
0  False  False
1  False  False
2  False  False

In [19]:
df.isnull().sum()      # Returns sum of all missing values

name    0
age     0
dtype: int64

## Data Manipulation

Data manipulation is an important aspect of data analysis, and Pandas provides a powerful set of tools for this purpose. In this tutorial, we will cover some advanced techniques for data manipulation using Pandas.

### Indexing

- `df.at[row_idx, col_name] = value`: Assign a new value to a single cell
- `df[col_name] = list or single value`: Assign a new value to a column. If a single value is provided, same value is assigned to all the rows of the given column

You can make similar use of `loc` and `iloc` as shown above to assign new values to the DataFrame.

In [20]:
df.head()       # Original DataFrame

    name  age
0   John   20
1  Harry   30
2  Alice   40

In [21]:
df.at[0 ,'age'] = 45     # Assigning new value by using `df.at[]`
df.head()

    name  age
0   John   45
1  Harry   30
2  Alice   40

In [22]:
df['salary'] = [1000, 500, 600]    # Assigning new column along with new values 
df['gender'] = ['M', 'M', 'F']    
df.head()

    name  age  salary gender
0   John   45    1000      M
1  Harry   30     500      M
2  Alice   40     600      F

In [23]:
import numpy as np 

df.loc[3] = ['Marine', 34, 420, 'F']      # Adding new values for 3rd row
df.loc[4] = ['Bobby', 50, np.nan, 'M']    # Assigning null value (nan) using numpy 
df.head()

     name  age  salary gender
0    John   45  1000.0      M
1   Harry   30   500.0      M
2   Alice   40   600.0      F
3  Marine   34   420.0      F
4   Bobby   50     NaN      M

### Methods

- `df.fillna(value)`: Fill missing values with the given *value*

- `df.dropna()`: Remove rows with missing values

- `df.drop(labels, axis)`: Drop specified rows or columns
    - *labels*: Single label or list of labels. Can be either index of a row or a column name
    - *axis*: Whether to drop row or column? row-wise (axis=1) or column-wise(axis=0)? (default=0)

- `df.rename(columns=mapper)`: Change the name of columns in the DataFrame
    - *mapper*: Dictionary whose keys represent old column names and values represent corresponding new column names

- `df.groupby(by, axis)`: Group DataFrame by one or more columns
    - *by*: Create groups based on by. It can be a mapping, function, label or list of labels
    - *axis*: How to group the DataFrame? row-wise (axis=1) or column-wise(axis=0)? (default=0)
    
- `df.apply(func, axis)`: Apply a function along an axis of the DataFrame
    - *func*: Function to apply along each column or row
    - *axis*: How to apply the function? row-wise (axis=1) or column-wise(axis=0)? (default=0)

In [24]:
df.fillna(1200)     # Fill missing values

     name  age  salary gender
0    John   45  1000.0      M
1   Harry   30   500.0      M
2   Alice   40   600.0      F
3  Marine   34   420.0      F
4   Bobby   50  1200.0      M

In [25]:
df.dropna()         # Drop rows with missing values

     name  age  salary gender
0    John   45  1000.0      M
1   Harry   30   500.0      M
2   Alice   40   600.0      F
3  Marine   34   420.0      F

In [26]:
df.drop(['name'], axis=1, inplace=True)     # Drop column
df

   age  salary gender
0   45  1000.0      M
1   30   500.0      M
2   40   600.0      F
3   34   420.0      F
4   50     NaN      M

In [27]:
df.drop(2, axis=0, inplace=True)        # Drop 2nd indexed row
df

   age  salary gender
0   45  1000.0      M
1   30   500.0      M
3   34   420.0      F
4   50     NaN      M

In [28]:
# Rename columns
df.rename(columns={'age': 'Age', 'salary': 'Salary($)', 'gender': 'Sex'}, inplace=True) 
df

   Age  Salary($) Sex
0   45     1000.0   M
1   30      500.0   M
3   34      420.0   F
4   50        NaN   M

In [29]:
grouped = df.groupby("Sex")
print("Aggregation application to grouped data:")
grouped.agg({"Age": "mean", "Salary($)": "mean"})

Aggregation application to grouped data:

           Age  Salary($)
Sex
F    34.000000      420.0
M    41.666667      750.0

In [30]:
# Function to return double of input x
def double(x):
    return x * 2

df["Age"].apply(double)                 # Apply double function on age

0     90
1     60
3     68
4    100
Name: Age, dtype: int64

In [31]:
df["Salary($)"].apply(lambda x: 3*x)    # Apply triple lambda function on salary

0    3000.0
1    1500.0
3    1260.0
4       NaN
Name: Salary($), dtype: float64

### References

- [Pandas Official Getting Started Tutorials](https://pandas.pydata.org/docs/getting_started/install.html)
- [Tirendaz Academy - Pandas Tutorial](https://github.com/TirendazAcademy/PANDAS-TUTORIAL)
- [Pandas API Reference Documentation](https://pandas.pydata.org/pandas-docs/stable/reference/)